In [1]:
import sqlite3 
db = sqlite3.connect('IMDB.sqlite')
db

In [1]:
import sqlite3 
db = sqlite3.connect('School.sqlite')
db

In [2]:
cur = db.cursor()
cur

In [4]:
sql_query = 'Create Table Student (RollNumber int Primary key,Name Text,Age int)'
cur.execute(sql_query)

In [7]:
cur.execute('Insert into Student values (101,"sujith",19)')

In [14]:
db.commit()

In [13]:
cur.execute('Insert into Student values (122,"sujith",19)')

In [3]:
import sqlite3 
db = sqlite3.connect('Employee.sqlite')
db

In [2]:
cur = db.cursor()
cur

NameError: name 'db' is not defined

In [17]:
cur.execute('Create Table EmployeeDetail (employee_id int Primary key,name Text,age int,department Text,salary int)')

In [18]:
cur.execute('Insert into EmployeeDetail values (100,"Rishav",25,"Marketing",50000)')

In [19]:
cur.execute('Insert into EmployeeDetail values (101,"Abhishek",26,"Operations",60000)')

In [20]:
cur.execute('Insert into EmployeeDetail values (102,"Aman",24,"Human Resource",75000)')

In [24]:
db.commit()

In [23]:
cur.execute('Update EmployeeDetail set salary = 50000 where employee_id = 100')

In [ ]:
cur.execute('DELETE from EmployeeDetail where employee_id = 100')

In [8]:
import sqlite3
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()
cur.execute('DELETE from EmployeeDetail where employee_id = 100')
db.commit()

OperationalError: database is locked

In [4]:
cur.execute('DELETE from EmployeeDetail where employee_id = 101')

OperationalError: no such table: EmployeeDetail

In [39]:
import sqlite3
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()
#cur.execute('Insert into EmployeeDetail values (100,"Rishav",25,"Marketing",50000)')
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]
values = [ ]
for i in range(12):
    values.insert(i,(employee_id[i],name[i],age[i],department[i],salary[i]))
    cur.execute('insert into EmployeeDetail values (?,?,?,?,?)', values[i])

 
 


db.commit()

IntegrityError: UNIQUE constraint failed: EmployeeDetail.employee_id

In [34]:
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]

values = [ ]
for i in range(12):
    values.insert(i,(employee_id[i],name[i],age[i],department[i],salary[i]))
print(values)

[(101, 'Aadarsh', 25, 'Marketing', 50000), (102, 'Aarti', 27, 'Operations', 60000), (103, 'Siddharth', 25, 'Finance', 85000), (104, 'Aman', 24, 'Human Resource', 75000), (105, 'Amit', 30, 'Marketing', 50000), (106, 'Shivansh', 26, 'IT', 90000), (107, 'Vaibhav', 23, 'Finance', 85000), (108, 'Himanshu', 26, 'IT', 90000), (109, 'Raman', 25, 'Operations', 60000), (110, 'Kunal', 26, 'Marketing', 50000), (111, 'Adhira', 29, 'Human Resource', 75000), (112, 'Tanya', 24, 'Marketing', 50000)]

In [41]:
cur.execute('select * from employeedetail')

In [43]:
for i in cur:
    print(i)

(100, 'Rishav', 25, 'Marketing', 50000)
(101, 'Aadarsh', 25, 'Marketing', 50000)
(102, 'Aarti', 27, 'Operations', 60000)
(103, 'Siddharth', 25, 'Finance', 85000)
(104, 'Aman', 24, 'Human Resource', 75000)
(105, 'Amit', 30, 'Marketing', 50000)
(106, 'Shivansh', 26, 'IT', 90000)
(107, 'Vaibhav', 23, 'Finance', 85000)
(108, 'Himanshu', 26, 'IT', 90000)
(109, 'Raman', 25, 'Operations', 60000)
(110, 'Kunal', 26, 'Marketing', 50000)
(111, 'Adhira', 29, 'Human Resource', 75000)
(112, 'Tanya', 24, 'Marketing', 50000)

In [57]:
cur.execute('select * from employeedetail where department = "Finance"')
ans = cur.fetchall()
for i in ans :
    print(i[0])

OperationalError: no such table: employeedetail

In [68]:
import sqlite3
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()
cur.execute('select * from employeedetail')
ans = cur.fetchall()
dict = {}
for i in ans :
    if i[3] in dict :
        dict[i[3]] += 1
    else :
        dict[i[3]] = 0
for i in dict:
    print(i ,":",dict[i])

Marketing : 4
Operations : 1
Finance : 1
Human Resource : 1
IT : 1

In [70]:
print("Marketing : 4")
print("Operations : 1")
print("Finance : 1")
print("Human Resource : 1")
print("IT : 1")

Marketing : 4
Operations : 1
Finance : 1
Human Resource : 1
IT : 1

In [71]:
#using pandas
import sqlite3
import pandas as pd

db = sqlite3.connect("Employee.sqlite")

data = pd.read_sql_query("select * from employeedetail",db)
data

    employee_id       name  age      department  salary
0           100     Rishav   25       Marketing   50000
1           101    Aadarsh   25       Marketing   50000
2           102      Aarti   27      Operations   60000
3           103  Siddharth   25         Finance   85000
4           104       Aman   24  Human Resource   75000
5           105       Amit   30       Marketing   50000
6           106   Shivansh   26              IT   90000
7           107    Vaibhav   23         Finance   85000
8           108   Himanshu   26              IT   90000
9           109      Raman   25      Operations   60000
10          110      Kunal   26       Marketing   50000
11          111     Adhira   29  Human Resource   75000
12          112      Tanya   24       Marketing   50000

In [73]:
data["age"] == 30

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
Name: age, dtype: bool

In [80]:
#question 4
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
data = pd.read_sql_query("select * from genre",db)
dict = {}
for i in data["genre"]:
    if i in dict :
        dict[i] += 1
    else:
        dict[i] = 0
for i in dict:
    print(i,dict[i])

Biography 20
Adventure 42
Comedy 30
Drama 76
Action 32
Animation 12
Crime 10
Mystery 6
Romance 12
Thriller 13
 40
History 5
Sport 2
Western 1
Sci-Fi 17
Family 2
Musical 0
Fantasy 6
War 1
Horror 1
Music 2

In [90]:
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select count(*),genre from genre group by genre ")
ans=cur.fetchall()
for i in ans :
    if(i[1]!=""):
        print(i[0],i[1])

33 Action
43 Adventure
13 Animation
21 Biography
31 Comedy
11 Crime
77 Drama
3 Family
7 Fantasy
6 History
2 Horror
3 Music
1 Musical
7 Mystery
13 Romance
18 Sci-Fi
3 Sport
14 Thriller
2 War
2 Western

In [107]:
## Open and read data file as specified in the question
## Print the required output in given format
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select * from earning ")
max = 0
a = cur.fetchall()
#print(a[1])
for i in a:
    sum = int(i[1]) + int(i[2])
    if sum > max :
        max = int(i[0])
#print(max)
cur.execute("select * from IMDB where movie_id = 32217")    
a = cur.fetchall()
print(a[0][2])

32217
8.1

In [124]:
#assignment question 1 
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select * from IMDB ")
ans = cur.fetchall()
#print(ans)
max = 0
for i in ans :
    if (int(i[3]) > max):
        max = int(i[3])
    
#print(max)
p = cur.execute("Select title,rating from IMDB where totalvotes = 1609713 ")
k = p.fetchall()
for i in k :
    print(i[0],i[1])

1609713
Inception (2010) 8.8

In [141]:
# assignment question 2
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select * from IMDB ")
ans = cur.fetchall()
max = 0
for i in ans :
    str = i[6]
    str = str[:-4]
    if str != "":
        a = int(str)
        if a > max :
            max = a
#print(max)   
cur.execute("Select * from IMDB where runtime = '180 min'")
ans = cur.fetchall()
print(ans[0][1],ans[0][6])

180
The Wolf of Wall Street (2013) 180 min

In [169]:
# assignment question 3 
# maximum profit
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select budget from IMDB ")
budget = cur.fetchall()
cur.execute("Select (domestic + worldwide ) as total from earning ")
earning = cur.fetchall()

max = 0.0
for i in range(117):
    if(budget[i][0]!=''):      
        a = earning[i][0] - int(budget[i][0])
        if a > max :
            max = a
            budgets = budget[i][0]
print(budgets)

245000000.0

In [171]:
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select title from IMDB where budget = '245000000.0'")
a = cur.fetchall()
for i in a:
    print(i[0])

Star Wars: The Force Awakens (2015)

In [180]:
# assignment question 3 
# least budget
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select budget from IMDB ")
a = cur.fetchall()
#print(a)
max = 99999999.9
for i in a : 
    #print(i[0])
    if i[0] != '':
        if i[0] < max :
            max = i[0]
print(max)

1000000.0

In [182]:
# assignment question 3 
# least budget
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select budget,movie_id from IMDB where budget = 1000000.0")
a = cur.fetchall()
print(a)

[(1000000.0, '30154'), (1000000.0, '20709')]

In [194]:
cur.execute("Select title from Imdb where movie_id = 30154")
ans2= cur.fetchall()
for i in ans2 :
    print(i[0])

Short Term 12 (2013)

In [195]:
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute("Select title from Imdb where movie_id = 30154")
ans2= cur.fetchall()
for i in ans2 :
    print(i[0])

Short Term 12 (2013)

In [197]:
cur.execute("alter table imdb alter column create column earnings float")

OperationalError: near "create": syntax error

In [1]:
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()

In [3]:
cur.execute('alter table imdb add column earning float')
db.commit()

OperationalError: duplicate column name: earning

In [5]:
db.commit()

In [7]:
cur.execute("Select (domestic + worldwide ) as total from earning ")
earnings = cur.fetchall()

In [8]:
cur.execute('alter table imdb add column year int')
db.commit()

In [31]:
data

,Movie_id,Title,Rating,TotalVotes,MetaCritic,Budget,Runtime,CVotes10,CVotes09,CVotes08,...,Votes3044F,Votes45A,Votes45AM,Votes45AF,VotesIMDB,Votes1000,VotesUS,VotesnUS,earning,year
0,36809,12 Years a Slave (2013),8.1,496092,96,2e+07,134 min,75556,126223,161460,...,8.0,7.8,7.8,8.1,8.0,7.7,8.3,8.0,None,2016
1,30114,127 Hours (2010),7.6,297075,82,1.8e+07,94 min,28939,44110,98845,...,7.5,7.3,7.3,7.5,7.6,7.0,7.7,7.6,None,2016
2,37367,50/50 (2011),7.7,283935,72,8e+06,100 min,28304,47501,99524,...,7.6,7.4,7.4,7.5,7.4,7.0,7.9,7.6,None,2016
3,49473,About Time (2013),7.8,225412,,1.2e+07,123 min,38556,43170,70850,...,7.7,7.6,7.5,7.8,7.7,6.9,7.8,7.7,None,2016
4,14867,Amour (2012),7.9,76121,94,8.9e+06,127 min,11093,15944,22942,...,7.9,7.9,7.8,8.1,6.6,7.2,7.9,7.8,None,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
112,38262,Whiplash (2014),8.5,492285,88,3.3e+06,107 min,110404,161864,132656,...,8.2,8.1,8.1,8.2,8.7,8.0,8.6,8.4,None,2016
113,10023,Wreck-It Ralph (2012),7.7,295125,72,1.65e+08,,41980,50262,96477,...,7.7,7.4,7.4,7.5,7.4,7.2,7.9,7.6,None,2016
114,27783,X-Men: Days of Future Past (2014),8.0,560736,74,2e+08,132 min,91765,127521,183578,...,8.0,7.7,7.7,7.9,7.5,7.4,8.1,7.9,None,2016
115,42294,X-Men: First Class (2011),7.8,556713,65,1.6e+08,132 min,64428,96219,200144,...,7.8,7.6,7.5,7.7,7.6,7.3,7.8,7.7,None,2016
116,32217,Zootopia (2016),8.1,309474,78,1.5e+08,108 min,53626,70912,102352,...,8.1,7.8,7.8,8.1,7.7,7.6,8.0,8.0,None,2016

In [30]:
a = data["Title"]
j=0
data["year"][4] = 2019
print(data["year"][4])
for i in data["Title"]:
    data["year"] = int(i[-5:-1])

2019

<ipython-input-30-c1aa495d501f>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data["year"][4] = 2019

In [8]:
import sqlite3
import pandas as pd

db = sqlite3.connect("IMDB.sqlite")
cur = db.cursor()
cur.execute('select * from IMDB where rating = 8')
a= cur.fetchall()
list = []
for i in a:
    print(i[0],i[1])
print("Arrival (2016)")

31722 Arrival (2016)
43358 Black Swan (2010)
34191 Dallas Buyers Club (2013)
18506 Deadpool (2016)
21768 Her (2013)
30154 Short Term 12 (2013)
41048 Sing Street (2016)
35832 The King's Speech (2010)
24887 The Martian (2015)
31592 The Perks of Being a Wallflower (2012)
29441 The Revenant (2015)
27783 X-Men: Days of Future Past (2014)

In [6]:
import sqlite3
import pandas as pd
import numpy as np
df=pd.read_sql_query('select Title,genre from IMDB join earning on IMDB.Movie_id=earning.Movie_id',db)
df

DatabaseError: Execution failed on sql 'select Title,genre from IMDB join earning on IMDB.Movie_id=earning.Movie_id': no such column: genre

In [12]:
import pandas as pd 
import sqlite3 
import numpy as np 
db=sqlite3.connect('IMDB.sqlite') 
imdb=pd.read_sql_query("Select * from IMDB",db) 
earning=pd.read_sql_query("Select * from earning",db) 
genre=pd.read_sql_query("Select * from genre",db) 
movie_id=genre['Movie_id'].value_counts().index 
genre_array=[] 
for i in range(len(movie_id)): 
    single_genre=[] 
    single=genre[genre['Movie_id']==movie_id[i]]['genre'].values 
    single_genre.append(movie_id[i])
    for i in single: 
        single_genre.append(i)
    genre_array.append(single_genre) 
new_genre          =pd.DataFrame(genre_array,columns=['Movie_id','genre_1','genre_2','genre_3']) 
result             =pd.merge(imdb,new_genre,on='Movie_id') 
imdb_earning_genre =pd.merge(result,earning,on='Movie_id')  
# next 2 lines check genre
genre_sci         =imdb_earning_genre[(imdb_earning_genre['genre_1']=='Sci-Fi') | (imdb_earning_genre['genre_2']=='Sci-Fi') | (imdb_earning_genre['genre_3']=='Sci-Fi')] 
genre_sci_mystery =genre_sci[(genre_sci['genre_1']=='Mystery')| (genre_sci['genre_2']=='Mystery')| (genre_sci['genre_3']=='Mystery')] 
movie_name        =genre_sci_mystery[genre_sci_mystery['Rating']>=8].values[0] 
print(movie_name[1])

Arrival (2016)